# Ch04 > Exercise 09
# This program allows to count how many bills (in KRW) can be used for certain amount of money.

a = int(input("교환할 돈은 얼마? "))
ftt = a//50000
tt = (a%50000)//10000
ft = ((a%50000)%10000)//5000
t = (((a%50000)%10000)%5000)//1000
fh = ((((a%50000)%10000)%5000)%1000)//500
h = (((((a%50000)%10000)%5000)%1000)%500)//100
f = ((((((a%50000)%10000)%5000)%1000)%500)%100)//50
ten = (((((((a%50000)%10000)%5000)%1000)%500)%100)%50)//10
remain = (((((((a%50000)%10000)%5000)%1000)%500)%100)%50)%10

print("50000원 %d장, 10000원 %d장, 5000원 %d장, 1000원 %d장" %(ftt, tt, ft, t))
print("500원 %d장, 100원 %d장, 50원 %d장, 10원 %d장" %(fh, h, f, ten))
print("바꾸지 못한 돈 ==> %d원" %remain)